'''
«Второй максимум»
Условие
Последовательность состоит из различных натуральных чисел и завершается числом 0. Определите значение второго по величине элемента в этой последовательности. Гарантируется, что в последовательности есть хотя бы два элемента.
'''

max1 = int(input())
max2 = int(input())
if max1 < max2:
    max1, max2 = max2, max1
new = int(input())
while new != 0:
    if new > max1:
        max2, max1 = max1, new
    elif new > max2:
        max2 = new
    new = int(input())
print(max2)