'''
«Количество элементов, которые больше предыдущего»
Условие
Последовательность состоит из натуральных чисел и завершается числом 0. Определите, сколько элементов этой последовательности больше предыдущего элемента.
'''

s1 = int(input())
s2 = int(input())
j=0

while s2 != 0:
    if s1<s2: j+=1
    s1=s2
    s2 = int(input())

print(j)