'''
«Количество четных элементов последовательности»
Условие
Определите количество четных элементов в последовательности, завершающейся числом 0.
'''

s = int(input())
j=0

while s != 0:
    if s%2==0: j+=1
    s = int(input())

print(j)