'''
«Количество элементов, равных максимуму»
Условие
Последовательность состоит из натуральных чисел и завершается числом 0. Определите, сколько элементов этой последовательности равны ее наибольшему элементу.
'''

s = int(input())
z=0
j=1

while s != 0:
    if z==s:
        j+=1
    if z<s:
        z=s
        j=1
    s = int(input())

print(j)