'''
«Максимум последовательности»
Условие
Последовательность состоит из натуральных чисел и завершается числом 0. Определите значение наибольшего элемента последовательности.
'''

s = int(input())
z=0

while s != 0:
    if z<s: z=s
    s = int(input())

print(z)