'''
«Степень двойки»
Условие
По данному натуральному числу N найдите наибольшую целую степень двойки, не превосходящую N. Выведите показатель степени и саму степень.

Операцией возведения в степень пользоваться нельзя!
'''

n=int(input())



i = 0

while 2**(i+1) <= n:

    
    i += 1
    


print(i, 2**i)