'''
«Больше своих соседей»
Условие
Дан список чисел. Определите, сколько в этом списке элементов, которые больше двух своих соседей, и выведите количество таких элементов. Крайние элементы списка никогда не учитываются, поскольку у них недостаточно соседей.
'''

a = [int(s) for s in input().split()]
i=0
for k in range(len(a)-2):

    if a[k]<a[k+1] and a[k+2]<a[k+1]: i+=1
    
print(i)