'''
«Количество различных элементов»
Условие
Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.
'''

a = [int(s) for s in input().split()]

d=1
for i in range(len(a)-1):
    if a[i]<a[i+1]:
        b=a[i]
        c=a[i+1]
        d+=1

print(d)