'''
«Количество слов в тексте»
Условие
Дан текст в первой строке записано число строк, далее идут сами строки. Определите, сколько различных слов содержится в этом тексте.

Словом считается последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки.

Во всех задачах считывайте входные данные через input() и выводите ответ через print().
'''

slova = set()
for ee in range(int(input())):
    slova.update(input().split())
print(len(slova))

# сами слова
# print(slova)