'''
«Полиглоты»
Условие
Каждый из некоторого множества школьников некоторой школы знает некоторое количество языков. Нужно определить сколько языков знают все школьники, и сколько языков знает хотя бы один из школьников.

В первой строке задано количество школьников. Для каждого из школьников сперва записано количество языков, которое он знает, а затем - названия языков, по одному в строке.

В первой строке выведите количество языков, которые знают все школьники. Начиная со второй строки - список таких языков. Затем - количество языков, которые знает хотя бы один школьник, на следующих строках - список таких языков. Языки нужно выводить в лексикографическом порядке, по одному на строке.
'''

B, C = set(), set()
m = int(input())
i = 0
while i<m:
    one = int(input())
    A=set()
    for n in range(one):
        A.add(input())
    B |= A
    if i==0:
        C = A
    else:
        C = C & A
    i+=1

print(len(B))
print(' '.join(sorted(B)))
print(len(C))
print(' '.join(sorted(C)))


'''
Standart
students = [{input() for j in range(int(input()))} for i in range(int(input()))]
- делает список множеств вводимых данных
known_by_everyone, known_by_someone = set.intersection(*students), set.union(*students)
- выявляет пересекающиеся (intersection) и объединенные (union)
print(len(known_by_everyone), *sorted(known_by_everyone), sep='\n')
print(len(known_by_someone), *sorted(known_by_someone), sep='\n')
'''